In [4]:
import pandas as pd
import numpy as np

Series - одномерный массив

In [7]:
sr1 = pd.Series([5, 6, 2, 9, 12])
sr1.shape

(5,)

In [9]:
sr1.values # numpy array

array([ 5,  6,  2,  9, 12])

In [10]:
sr1.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
sr1[3]

9

In [12]:
sr1[:3]

0    5
1    6
2    2
dtype: int64

In [13]:
sr2 = pd.Series([4,2,2, 9, 12], index=[
    'Курс жентсвенности',
    'Марафон зачатия',
    'Марфон женского дыхания',
    'Курс мужественности',
    'Как стать богатым'
])

sr2

Курс жентсвенности          4
Марафон зачатия             2
Марфон женского дыхания     2
Курс мужественности         9
Как стать богатым          12
dtype: int64

In [14]:
sr2.index

Index(['Курс жентсвенности', 'Марафон зачатия', 'Марфон женского дыхания',
       'Курс мужественности', 'Как стать богатым'],
      dtype='object')

In [15]:
sr2['Марафон зачатия']

2

In [ ]:
sr2[:'Марафон зачатия'] # ВКЛЮЧАЯ

Курс жентсвенности    4
Марафон зачатия       2
dtype: int64

In [18]:
sr3 = pd.Series({
    'Курс жентсвенности': 1199,
    'Марафон зачатия': 999,
    'Марфон женского дыхания': 1000000,
    'Курс мужественности': 200,
    'Как стать богатым': 500
})

In [19]:
sr3

Курс жентсвенности            1199
Марафон зачатия                999
Марфон женского дыхания    1000000
Курс мужественности            200
Как стать богатым              500
dtype: int64

In [20]:
sr3.index = [
    'Курс жентсвенности 2',
    'Марафон зачатия 2',
    'Марфон женского дыхания 2',
    'Курс мужественности 2',
    'Как стать богатым 2'
    ]
sr3

Курс жентсвенности 2            1199
Марафон зачатия 2                999
Марфон женского дыхания 2    1000000
Курс мужественности 2            200
Как стать богатым 2              500
dtype: int64

---

In [35]:
sales = pd.Series([4,2,2, 9, 12, 5], index=[
    'Курс жентсвенности',
    'Марафон зачатия',
    'Марфон женского дыхания',
    'Курс мужественности',
    'Как стать богатым',
    'Авитолог'
])

price = pd.Series({
    'Курс жентсвенности': 1199,
    'Марафон зачатия': 999,
    'Марфон женского дыхания': 1000000,
    'Курс мужественности': 200,
    'Как стать богатым': 500
})

In [36]:
sales, price

(Курс жентсвенности          4
 Марафон зачатия             2
 Марфон женского дыхания     2
 Курс мужественности         9
 Как стать богатым          12
 Авитолог                    5
 dtype: int64,
 Курс жентсвенности            1199
 Марафон зачатия                999
 Марфон женского дыхания    1000000
 Курс мужественности            200
 Как стать богатым              500
 dtype: int64)

In [37]:
course = pd.DataFrame({'Продажи': sales,
                       'Цены': price})
course

                         Продажи       Цены
Авитолог                       5        NaN
Как стать богатым             12      500.0
Курс жентсвенности             4     1199.0
Курс мужественности            9      200.0
Марафон зачатия                2      999.0
Марфон женского дыхания        2  1000000.0

In [38]:
course.reset_index()

                     index  Продажи       Цены
0                 Авитолог        5        NaN
1        Как стать богатым       12      500.0
2       Курс жентсвенности        4     1199.0
3      Курс мужественности        9      200.0
4          Марафон зачатия        2      999.0
5  Марфон женского дыхания        2  1000000.0

In [39]:
course.Продажи

Авитолог                    5
Как стать богатым          12
Курс жентсвенности          4
Курс мужественности         9
Марафон зачатия             2
Марфон женского дыхания     2
Name: Продажи, dtype: int64

In [40]:
course.columns

Index(['Продажи', 'Цены'], dtype='object')

In [44]:
pd1 = pd.DataFrame([{'Название': 'Поиск ниш', 'Продажи': 10, 'Цена': 5000},
                    {'Название': 'Марафон желаний', 'Продажи': 3, 'Цена': 50000}], index=['first', "second"])
pd1

               Название  Продажи   Цена
first         Поиск ниш       10   5000
second  Марафон желаний        3  50000

In [46]:
data = {'Курс': ['Как стрельнуть в тиктоке', 'Курс по пайтону'],
        'Цена': [200, 300]
        }

pd2 = pd.DataFrame(data=data)
pd2

                       Курс  Цена
0  Как стрельнуть в тиктоке   200
1           Курс по пайтону   300